#+TITLE: Lecture 7B: Metacircular Evaluator, Part 2
#+AUTHOR: Fabricio Puente-Mansilla
#+DATE: <2026-05-02 Sat>
#+OPTIONS: toc:2
#+PROPERTY: header-args:elisp :results output :exports both

* Elisp Demonstration: The Pairing Logic

Here is how that pairing logic looks when implemented in Emacs
Lisp. You can evaluate this block to see how Lisp handles the
"symbolic tail" during variable binding.

#+BEGIN_SRC elisp
  (defun pair-up (vars vals)
    "Matches formal parameters (VARS) to arguments (VALS)."
    (cond
     ;; Base case: both are empty
     ((and (null vars) (null vals))
      nil)

     ;; The Symbolic Tail case (e.g., the 'y' in (x . y) or just 'x')
     ((symbolp vars)
      (list (cons vars vals)))

     ;; Error cases
     ((null vars) (error "Too many arguments"))
     ((null vals) (error "Too few arguments"))

     ;; Standard recursive pairing
     (t
      (cons (cons (car vars) (car vals))
            (pair-up (cdr vars) (cdr vals))))))

  ;; Test 1: Fixed Arguments (x y z)
  (princ (format "Fixed: %s\n"
                 (pair-up '(x y z) '(1 2 3))))

  ;; Test 2: Dot Notation (x . y)
  (princ (format "Dotted: %s\n"
                 (pair-up '(x . y) '(1 2 3 4 5))))

  ;; Test 3: Single Symbol (x) -> captures everything
  (princ (format "Single Symbol: %s\n"
                 (pair-up 'x '(1 2 3))))
#+END_SRC

#+RESULTS:
: Fixed: ((x . 1) (y . 2) (z . 3))
: Dotted: ((x . 1) (y 2 3 4 5))
: Single Symbol: ((x 1 2 3))

